Revit 2024 API
FaceSplitter Class
 Represents an element that splits a face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class FaceSplitter : Element
Visual Basic
Public Class FaceSplitter _
	Inherits Element
Visual C++
public ref class FaceSplitter : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.FaceSplitter
See Also
FaceSplitter Members
Autodesk.Revit.DB Namespace